import { useEffect } from "react";

function privacypolicy() {
 
    return(
        <>
        <div style={{width:'800px',  margin:'0 auto'}}>

        <h2>개인정보 처리방침</h2>
    <br/>
    <p>뉴스피스 서비스를 이용해 주셔서 감사합니다. 저희는 이용자의 개인정보를 매우 중요하게 생각하고 있습니다. 이에 따라 개인정보 보호를 위해 최선을 다하고 있습니다. 아래는 뉴스피스에서 수집하는 개인정보의 종류와 그 처리에 대한 안내입니다.</p>
    <br/>
    <b><p>[수집하는 개인정보의 항목]</p></b>
    <br/>
    <p>뉴스피스는 회원 가입 및 서비스 이용을 위해 다음과 같은 개인정보를 수집하고 있습니다.</p>
    <ul>
        <li>1. 이메일 주소</li>
        <li>2. 사용자 이름</li>
        <li>3. 기타 회원가입에 필요한 정보</li>
    </ul>
    <br/>
    <b><p>[개인정보의 수집 목적]</p></b>
    <br/>
    <p>뉴스피스는 수집한 개인정보를 다음과 같은 목적으로 이용합니다.</p>
    <ol>
        <li>1. 회원 가입 및 관리</li>
        <li>2. 서비스 제공 및 운영</li>
        <li>3. 이용자에게 서비스 관련 소식 전달</li>
    </ol>
    <br/>
    <b><p>[개인정보의 보유 및 이용 기간]</p></b>
    <br/>
    <p>뉴스피스는 이용자의 개인정보를 회원 탈퇴 시까지 보유하며, 서비스 이용 중 또는 서비스 제공 종료 시에는 즉시 파기됩니다.</p>
    <br/>
    <b><p>[개인정보의 제공 및 공유]</p></b>
    <br/>
    <p>뉴스피스는 이용자의 개인정보를 본인의 동의 없이 타 기업이나 제3자에게 제공하지 않습니다.</p>
    </div>
    </>
    );
}

export default privacypolicy;